/*Задача 3. Обмен местами

int main() {
int a = 42;
int b = 153;

std::cout << "a: " << a << "\n";
std::cout << "b: " << b << "\n";
}

Есть код программы с двумя переменными типа int и выводом этих переменных на экран. 
Напишите программу, которая меняет значения переменных местами, то есть нужно добиться того, 
чтобы в переменной a лежало значение b, а в b - значение a.*/